from src.models.interface import Tag

NUMBER_DETERMINERS = {"한두", "첫", "두", "세", "네", "다섯", "여섯", "일곱", "여덟", "아홉", "열", "백", "천", "만", "억"}
MONEY_DETERMINERS = {"골드", "엔", "원", "다이아", "달러"}
JOSA_TARGETS = {Tag.일반명사, Tag.고유명사}

되다_ALLOWS = {"가드", "가결", "개화", "공개", "교환", "과대평가", "과소평가", "과장", "구조", "기대", "누적", "노미네이트", "녹음", "다운로드", "대물림", "디자인", "딜레이", "로그인", "로컬라이징", "리뉴얼", "리드", "리메이크", "마무리", "맞교환", "매매", "모자이크", "묘사", "문제", "물갈이", "발사", "보관", "봉인", "사용", "서비스", "시험", "업그레이드", "콜업", "업로드", "오픈", "유산", "인스톨", "조치", "종료", "중단", "처리", "출시", "캐스팅", "탈바꿈", "트레이드", "폐쇄", "편집", "폐문", "프린팅", "플러스", "피격", "형성", "해고", "해금", "해방", "해체", "행방불명", "다운사이징", "되풀이", "드랍", "바운딩", "로테이션", "리다이렉트", "리모델링", "리워크", "먹통", "바꿔치기", "발동", "발매", "배제", "밸런싱", "번역", "분배", "뻥튀기", "상쇄", "생성", "설정", "스크롤", "악화", "업데이트", "일단락", "감소", "강화", "개편", "공중분해", "교체", "냉각", "드롭", "디지타이즈", "랭크업", "렌더링", "리사이징", "전시", "전개", "절하", "강판", "경질", "고갈", "구동", "다운그레이드", "다운", "체포", "데포르메", "동화", "둔갑", "리스폰", "리타이어", "리마스터", "명명", "모델링", "바운드", "변경", "상향", "셧다운", "스카우트", "스폰", "싹쓸이", "아웃", "악용", "어레인지", "언락", "업", "장전", "제외", "진행", "참작", "축약", "충전", "카운트", "클리닝", "클리어", "타게팅", "특화", "판단", "패치", "편곡", "리스폰", "프로그래밍", "해제", "해지", "확인", "환송", "개발", "감화", "건조", "결여", "손상", "구분", "당선", "반감", "보고", "보충", "복구", "안내", "저장", "전달", "조정", "코팅", "텔레포트", "패러디", "흡수", "개발", "경과", "공포", "단축", "도배", "동봉", "디버프", "리젠", "마개조", "반박", "바리에이션", "배치", "선택", "설명", "수입", "스카웃", "신고", "업뎃", "록온", "완료", "리워크", "장착", "암전", "정리", "정화", "제작", "젠", "증원", "지원", "채용", "대차", "대체", "초과", "미달", "추가", "컷오프", "탁음화", "탄핵", "통과", "파견", "포함", "표기", "필터링", "합격", "해석", "후술", "오픈"}

되다_EXCEPTIONS = {"얼마", "말", "기회", "부자", "배", "숙부", "여행", "형", "언니", "누나", "엄마", "아빠", "삼촌", "이모", "고모", "남편", "아내", "이튿날", "정도", "축제", "여정", "시간", "때", "돈", "습관", "파뿌리", "상태", "말동무", "후반부", "습관", "아미타불", "나중", "팬", "한참", "달", "이상", "한참", "대명사", "쯤", "구슬", "꼴찌", "연휴", "하루", "며칠", "불기둥", "실세", "아이", "이득", "친구", "타임", "배우", "가량", "경기", "비서실장", "설상가상", "넘버원", "약", "새사람", "피범벅", "배심원", "가해자", "어머니", "아버지", "아비", "이상", "정도", "오랫동안", "용", "투수", "할머니", "할아버지", "협회", "혼자", "감독", "꼴", "교육감", "대통령", "왕", "일원"}

받다_ALLOWS = {"감동", "검사", "견제", "경고", "경례", "계승", "공격", "과대평가", "교육", "구원", "구박", "내정", "냉대", "다운", "다운로드", "답변", "대우", "면제", "멸시", "발급", "발령", "발주", "방해", "배정", "벌", "보고", "보급", "보답", "보상", "보호", "부여", "분배", "분양", "비난", "비판", "사랑", "사면", "상처", "선고", "선택", "선물", "세례", "수여", "수령", "수리", "수업", "수혈", "신청", "승인", "신임", "습격", "악수", "양도", "억압", "열", "영향", "오해", "외면", "용서", "인계", "인도", "인정", "자극", "저주", "전달", "제공", "제안", "제재", "제한", "조명", "조사", "존경", "주목", "주문", "지원", "지적", "차별", "처벌", "초대", "추천", "축복", "축하", "충격", "치료", "치유", "칭송", "통보", "평가", "피해", "하달", "하사", "호평", "허락", "협박"}
받다_DENYS = {"관심", "도움", "동정", "만점", "미움", "보살핌", "부케"}

하다_MUST_ATTACHED = {"고려"}

모음연결어미_FORMS = {"어", "어다", "어도", "어라", "어서", "어야", "어야만", "어요", "여", "여서", "오", "오니", "요", "으나", "으니", "으니까", "으라고", "으라면", "으러", "으려", "으려고", "으려다", "으려면", "으리라", "으며", "으면", "으면서", "으면서도", "으므로", "은데", "은지", "은지라", "을까", "을래", "을려고", "을수록", "을지"}
모음선어말어미_FORMS = {"었"}
모음관형사형전성어미_FORMS = {"은", "을"}

ㄹ사용불가_연결어미_FORMS = 모음연결어미_FORMS - {"어", "어다", "어도", "어라", "어서", "어야", "어야만", "어요", "여", "여서", "오", "오니", "요"}

있다_없다_띄어쓰기_set = {"인기", "필요", "품위", "가치", "자비", "자신", "면목", "관심", "부담", "실력", "인망", "의미", "눈치", "감정"}
없다_띄어쓰기_set = {"걱정", "소리", "겁", "죄", "싸가지", "후회", "중복", "가차", "대꾸", "무리"}
없다_붙여쓰기_set = {"꼼짝", "쓸데", "문제", "빈틈", "온데간데", "꾸밈", "스스럼", "부질", "재미", "소용", "틀림", "쓸데", "끊임", "다름", "염치", "빈틈", "정신", "다름", "변함", "끄떡", "문제", "어처구니", "인정사정", "어이", "유례", "끝", "터무니"}

날짜_FORMS = {"하루", "이틀", "사흘", "나흘", "닷새", "엿새", "이레", "여드레", "아흐레", "열흘", "달", "개월", "년", "초", "분", "시간", "주", "주일", "며칠", "반년", "보름", "해", "일주일"}

단위_FORMS = {"라운드", "턴", "시즌"}

복합_3_동사들 = {"가라앉", "가져가", "가져오", "갈라지", "곁들이", "공들이", "괴롭히", "굳어지", "그만하", "기어들", "기어오르", "기울이", "깨뜨리", "깨어나", "끊어지", "끌려가", "끌려들", "끝마치", "끝장내", "나타나", "나타내", "낚아채", "날아가", "남아돌", "내려가", "내버리", "내보내", "넘어가", "넘어서", "놀아나", "눌러앉", "늘어나", "늘어서", "다가서", "다가오", "다독이", "달라지", "달려가", "달아나", "달아오르", "데려가", "도망가", "도망치", "돌려주", "돌아가", "돌아보", "돌아서", "돌이키", "되돌리", "되살리", "뒤섞이", "뒤처지", "뒤쳐지", "드러나", "들러붙", "들어가", "들어서", "들어오", "따라가", "따라오", "떠나가", "떠넘기", "떠먹이", "떠밀리", "떠받들", "떠오르", "떨어지", "뛰어넘", "뛰어들", "뜯어먹", "망가지", "망설이", "맞이하", "매달리", "멀어지", "몰아내", "무너지", "물리치", "바닥나", "바라보", "반짝이", "받아치", "발라내", "벌어지", "벗어나", "보살피", "부딪치", "부딪히", "부러지", "부서지", "불어넣", "불태우", "붙잡히", "빠뜨리", "빼앗기", "사라지", "선보이", "스며들", "쓰러지", "알려지", "알아보", "알아채", "어긋나", "얼어붙", "얽매이", "엇나가", "올라가", "올라오", "움직이", "이름나", "이어지", "일깨우", "일으키", "작살내", "주어지", "줄어들", "지켜보", "쫓겨나", "쫓아내", "찾아가", "책임지", "처박히", "치달리", "터뜨리", "틀어막", "파헤치", "팽개치", "해치우", "헤어지", "헤엄치", "헷갈리", "휩쓸리", "흘러들", "흩트리", "흩날리", "흩어지"}
복합_3_규칙_동사들 = {"사로잡"}

보조용언_FORMS = {"가", "내", "놓", "달", "두", "드리", "버리", "보", "오", "있", "주", "하"}